{
  "workouts": [
    {
      "category": "Cardio",
      "exercises": [
        {
          "name": "Running",
          "description": "Running is a great way to improve cardiovascular fitness and burn calories. Start by jogging at a moderate pace, and gradually increase your speed and distance over time.",
          "parameters": {
            "distance": "km",
            "time": "minutes"
          }
        },
        {
          "name": "Jumping Jacks",
          "description": "Jumping jacks are a classic cardio exercise that gets your heart rate up and works multiple muscle groups. Stand with your feet together and arms at your sides, then jump and raise your arms above your head.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Sprinting",
          "description": "Sprinting is a high-intensity cardio exercise that improves power and speed. Start by running at a moderate pace, then increase your speed to a full-out sprint for a short distance.",
          "parameters": {
            "distance": "m",
            "time": "seconds"
          }
        }
      ]
    },
    {
      "category": "Strength",
      "exercises": [
        {
          "name": "Push-Ups",
          "description": "Push-ups are a classic bodyweight exercise that works the chest, shoulders, and triceps. Start in a plank position with your hands shoulder-width apart, then lower your body until your chest nearly touches the ground.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Pull-Ups",
          "description": "Pull-ups are a great exercise for building upper body strength and endurance. Use an overhead bar or pull-up bar, and grip it with your palms facing away from you. Pull your body up until your chin is above the bar.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Squats",
          "description": "Squats are a compound exercise that works the legs, hips, and core. Stand with your feet shoulder-width apart, then lower your body as if you were sitting back into a chair.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Deadlifts",
          "description": "Deadlifts are a compound exercise that works the legs, hips, and lower back. Stand with your feet hip-width apart, then bend your knees and lower your body to grip a barbell on the floor. Slowly stand up, keeping your back straight and the barbell close to your body.",
          "parameters": {
            "weight": "kg",
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Dips",
          "description": "Dips are a great exercise for the chest, triceps and shoulders. You can perform dips using parallel bars or by using two sturdy chairs or benches. Start by placing your hands on the bars or chairs, with your arms straight and your body suspended above the ground. Lower your body by bending your elbows, then push back up to the starting position.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        }
      ]
    },
    {
      "category": "Stretching",
      "exercises": [
        {
          "name": "Neck Rolls",
          "description": "Neck rolls help to release tension in the neck and shoulders. Start by sitting or standing with good posture, then gently roll your head in a circular motion, going from one shoulder to the other.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Shoulder Stretch",
          "description": "Shoulder stretches help to release tension in the shoulders and upper back. Start by standing or sitting with good posture, then raise one arm and use the other hand to gently pull it across your chest.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        },
        {
          "name": "Hamstring Stretch",
          "description": "Hamstring stretches help to release tension in the back of the legs. Start by sitting on the ground with both legs extended straight in front of you. Slowly reach forward, trying to touch your toes.",
          "parameters": {
            "repetitions": "",
            "sets": ""
          }
        }
      ]
    }
  ]
}